# Exercise 2: Drinks

Thanks to [@justmarkham](http://github.com/justmarkham) for providing the `drinks.csv` dataset.

### 0. Activate Autosave

In [49]:
%autosave 15

Autosaving every 15 seconds

### 1. Import the necessary modules

In [50]:
import pandas as pd

### 2. Use `pandas` to download the [`drinks.csv` dataset from here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv) and store it in a variable called `drinks`

In [51]:
drinks = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv")

### 3. Checkout the first 10 entries of the dataset
_Hint_: The `head()` function accepts an argument

In [52]:
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NaN
6,Argentina,193,25,221,8.3,SA
7,Armenia,21,179,11,3.8,EU
8,Australia,261,72,212,10.4,OC
9,Austria,279,75,191,9.7,EU

### 4. What is the number of observations in the dataset?

In [53]:
drinks.shape[0]

193

### 5. What is humanity's mean value for the total consumption of pure alcohol?

In [54]:
drinks["total_litres_of_pure_alcohol"].mean()

4.717098445595855

### 6. On which continent do people consume the most alcohol?
_Hint_: Checkout [`pandas.DataFrame.sort_values`](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values)

In [55]:
continent_group = drinks.groupby("continent")

In [56]:
sum_of_total = continent_group.sum()

In [57]:
sum_of_total

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,3258,866,862,159.4
AS,1630,2677,399,95.5
EU,8720,5965,6400,387.8
OC,1435,935,570,54.1
SA,2101,1377,749,75.7

In [58]:
new_order = sum_of_total.sort_values("total_litres_of_pure_alcohol", ascending=False)

In [59]:
print("The continent with the highest alcohol consumption is", new_order.index[0])

The continent with the highest alcohol consumption is EU

In [60]:
new_order.head(1)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
EU,8720,5965,6400,387.8